### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [61]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# Raw data file
file_to_load = "Resources/purchase_data.csv"

# Read purchasing file and store into pandas data frame
purchase_df = pd.read_csv(file_to_load)
purchase_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

## Player Count

* Display the total number of players

In [63]:
# display total number of players
# 1 total_players = purchase_data["SN"].value_counts()
players_count = len(purchase_df["SN"].unique())
players_count

summary_table = pd.DataFrame({"Total Players" : players_count}, index=[0])
summary_table

# SAMPLE Calculate the number of unique players in the DataFrame
#author_count = len(goodreads_df["Authors"].unique())

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [69]:
# purchase_data["avg_price"] = purchase_data["Price"].map("${:.2f}".format)
# purchase_data["avg_price"]
#file_df["avg_cost"] = file_df["avg_cost"].map("${:.2f}".format)

# 2
items_count = len(purchase_df["Item ID"].unique())

# 3
avg_price = purchase_df["Price"].mean()

# 4
total_purchases = len(purchase_df["Purchase ID"].unique())

# 5
total_revenues = purchase_df["Price"].sum()
# total_revenues = total_revenues.map("${:.2f}".format)

# Place all of the data found into a summary DataFrame
summary_table = pd.DataFrame({"Total Players" : players_count,
                              "Number of Unique Items" : items_count,
                              "Average Price" : [avg_price],
                              "Number of Purchases" : [total_purchases],
                              "Total Revenues" : [total_revenues]})
summary_table

,Total Players,Number of Unique Items,Average Price,Number of Purchases,Total Revenues
0,576,183,3.050987,780,2379.77

## Gender Demographics

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
# DEMO gender demographics output sample below

                       Percentage of Players  Total Count
Male                                  113.19          652
Female                                 19.62          113
Other / Non-Disclosed                   2.60           15

In [78]:
# Create a GroupBy object based upon "View Group"
# ted_group = ted_df.groupby("View Group")
# groupby first 

demo_gb = pd.DataFrame(purchase_df.groupby("Gender").SN.nunique())

demo_gb["Percentage of Players"] = demo_gb["SN"] / sum(demo_gb["SN"])

demo_gb = demo_gb.rename(columns={"SN":"Screename Total Count"})

demo_gb.head()

# divide 

# Find how many rows fall into each bin
# print(ted_group["comments"].count())

# Get the average of each column within the GroupBy object
# ted_group[["comments", "duration", "languages"]].mean()

# 3
# percent_players = purchase_df["Price"]

# 4
# total_purchases = len(purchase_df["Purchase ID"].unique())


# Place all of the data found into a summary DataFrame
#summary_table = pd.DataFrame({"Percentage of Players" : [avg_price],
#                              "Total Count" : [total_purchases]})
# summary_table

                       Screename Total Count  Percentage of Players
Gender
Female                                    81               0.140625
Male                                     484               0.840278
Other / Non-Disclosed                     11               0.019097


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, etc. by gender


* For normalized purchasing, divide total purchase value by purchase count, by gender


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
# demo

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
Gender,,,,
Female,113,$3.20,$361.94,$3.20
Male,652,$3.02,"$1,967.64",$3.02
Other / Non-Disclosed,15,$3.35,$50.19,$3.35

In [97]:
# groupby first 
gender_gb = pd.DataFrame(purchase_df.groupby("Gender").count())
purchase_analysis = gender_gb[['Age']].rename(columns={'Age': 'Purchase Count'})
purchase_analysis['Average Purchase Price'] = purchase_df.groupby("Gender").sum()['Price'] / purchase_analysis['Purchase Count']
purchase_analysis['Total Purchase Value'] = purchase_df.groupby("Gender").sum()['Price']
# normalized totals total purchase value / purchase count
purchase_analysis['Normalized Totals'] = purchase_df.groupby("Gender").sum()['Price'] / purchase_analysis['Purchase Count']
purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
Gender,,,,
Female,113,3.203009,361.94,3.203009
Male,652,3.017853,1967.64,3.017853
Other / Non-Disclosed,15,3.346000,50.19,3.346000

In [82]:
# purchase_df.groupby("Gender").sum()['Price'] / purchase_analysis['Purchase Count']
purchase_df.groupby("Gender").sum()['Price']

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [ ]:
# Demo

In [6]:
# Establish bins for ages
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

       Percentage of Players  Total Count
<10                     3.99           23
10-14                   4.86           28
15-19                  23.61          136
20-24                  63.37          365
25-29                  17.53          101
30-34                  12.67           73
35-39                   7.12           41
40+                     2.26           13

In [155]:
# Establish bins for ages
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [150]:
demo_gb = pd.DataFrame(purchase_df.groupby("Gender").SN.nunique())

demo_gb["Percentage of Players"] = demo_gb["SN"] / sum(demo_gb["SN"])

demo_gb = demo_gb.rename(columns={"SN":"Screename Total Count"})

demo_gb

                       Screename Total Count  Percentage of Players
Gender
Female                                    81               0.140625
Male                                     484               0.840278
Other / Non-Disclosed                     11               0.019097

In [161]:
pd.cut(purchase_df["Age"], age_bins, labels=group_names).head()

TypeError: '<' not supported between instances of 'float' and 'str'

In [158]:
purchase_df["Age"] = pd.cut(purchase_df["Age"], age_bins, labels=group_names)
purchase_df.head()

#age_group = purchase_df.groupby("Age")

#print(age_group["SN"].count())

#age_group[[""]]

TypeError: '<' not supported between instances of 'float' and 'str'

In [157]:
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Summary
0,0,Lisim78,20-24,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40+,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,20-24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,20-24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,20-24,Male,131,Fury,1.44,20-24

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, etc. in the table below


* Calculate Normalized Purchasing


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
10-14,28,$2.96,$82.78,$2.96
15-19,136,$3.04,$412.89,$3.04
20-24,365,$3.05,"$1,114.06",$3.05
25-29,101,$2.90,$293.00,$2.90
30-34,73,$2.93,$214.00,$2.93
35-39,41,$3.60,$147.67,$3.60
40+,13,$2.94,$38.24,$2.94
<10,23,$3.35,$77.13,$3.35

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80